; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-4nodes-1000size-3degree-100mindistance-3trucks-2packages-103seed

(define (problem transport-two-cities-sequential-4nodes-1000size-3degree-100mindistance-3trucks-2packages-103seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 956,736 -> 731,467
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 36)
  ; 731,467 -> 956,736
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 36)
  ; 713,752 -> 731,467
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 29)
  ; 731,467 -> 713,752
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 29)
  ; 713,752 -> 956,736
  (road city-1-loc-3 city-1-loc-2)
  (= (road-length city-1-loc-3 city-1-loc-2) 25)
  ; 956,736 -> 713,752
  (road city-1-loc-2 city-1-loc-3)
  (= (road-length city-1-loc-2 city-1-loc-3) 25)
  ; 837,220 -> 731,467
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 27)
  ; 731,467 -> 837,220
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 27)
  ; 837,220 -> 956,736
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 53)
  ; 956,736 -> 837,220
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 53)
  ; 837,220 -> 713,752
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 55)
  ; 713,752 -> 837,220
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 55)
  ; 2934,617 -> 2705,79
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 59)
  ; 2705,79 -> 2934,617
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 59)
  ; 2670,391 -> 2705,79
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 32)
  ; 2705,79 -> 2670,391
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 32)
  ; 2670,391 -> 2934,617
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 35)
  ; 2934,617 -> 2670,391
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 35)
  ; 2472,911 -> 2934,617
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 55)
  ; 2934,617 -> 2472,911
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 55)
  ; 2472,911 -> 2670,391
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 56)
  ; 2670,391 -> 2472,911
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 56)
  ; 956,736 <-> 2472,911
  (road city-1-loc-2 city-2-loc-4)
  (= (road-length city-1-loc-2 city-2-loc-4) 153)
  (road city-2-loc-4 city-1-loc-2)
  (= (road-length city-2-loc-4 city-1-loc-2) 153)
  (at package-1 city-1-loc-3)
  (at package-2 city-1-loc-1)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-2)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-2)
  (at truck-3 city-2-loc-1)
  (capacity truck-3 capacity-2)
 )
 (:goal (and
  (at package-1 city-2-loc-2)
  (at package-2 city-2-loc-1)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
2. (drive truck-1 city-1-loc-2 city-1-loc-3)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-3)
   goals met: 0 of 2
3. (pick-up truck-1 city-1-loc-3 package-1 capacity-1 capacity-2)
   deleted: (at package-1 city-1-loc-3) (capacity truck-1 capacity-2)
   added: (in package-1 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 2
4. (drive truck-1 city-1-loc-3 city-1-loc-1)
   deleted: (at truck-1 city-1-loc-3)
   added: (at truck-1 city-1-loc-1)
   goals met: 0 of 2
5. (pick-up truck-1 city-1-loc-1 package-2 capacity-0 capacity-1)
   deleted: (at package-2 city-1-loc-1) (capacity truck-1 capacity-1)
   added: (in package-2 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 2
6. (drive truck-1 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-1)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
7. (drive truck-1 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 2
8. (drive truck-1 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 2
9. (drop truck-1 city-2-loc-2 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-2-loc-2) (capacity truck-1 capacity-1)
   goals met: 1 of 2
10. (drive truck-1 city-2-loc-2 city-2-loc-1)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-1)
   goals met: 1 of 2
11. (drop truck-1 city-2-loc-1 package-2 capacity-1 capacity-2)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-1)
   added: (at package-2 city-2-loc-1) (capacity truck-1 capacity-2)
   goals met: 2 of 2
